---
kind: type
id: T:Autodesk.Revit.DB.ShapeBuilder
source: html/66c1678c-2e01-e0de-1386-5a0e1eb3ccff.htm
---
# Autodesk.Revit.DB.ShapeBuilder

The base class for geometry builder classes.

## Syntax (C#)
```csharp
public class ShapeBuilder : IDisposable
```